void main() {

  /* 1. 打印出0~50的所有偶數 */

  for (int i = 0; i <= 50; i++) {
    if (i % 2 == 0) {
      print(i);
    }
  }

  /* 2. 求 1 + 2..... 加到 100 的合 */

  // int i,sum = 0;

  // for ( i = 1; i <= 100; i++) {
  //   sum += i;
  // }

  // print(sum);

  /*
      sum=0+1;

      sum=0+1+2;

      sum=0+1+2+3+.....100;
    */

  /* 3. 計算5的階乘 (1*2*3*4*5   ) */

  // int i, sum = 1;

  // for (i = 1; i <= 5; i++) {
  //   sum *= i;
  // }

  // print(sum);

  /*
      sum=1*2;

      sum=1*2*3;

      sum=1*2*3*4;

      sum=1*2*3*4*5;
    */

  /* 4. 打印List ["張三","李四","老五"] 裡面的內容 */

  // List l1 = ["張三", "李四", "老五"];

  // // 要從0開始 因為是 0 1 2 所以也小於3 不能用小於等於
  // // 要跑到的位置 最好不要用自己打的數字 用l1.length 容錯率較高
  // for (int i = 0; i < l1.length; i++) {
  //   print(l1[i]); // 張三  李四   老五
  // }               // l1[0] l1[1] l1[2]
}