void main() {
  // 1. 基礎賦值運算符號  =   ??=

  int a = 10;
  int b = 3;

  print(a);

  int c = a + b; //從左到右賦值
  print(c); // 13

  // b??=23; 表示如果b為空的話 把23賦值給b

  // int a = 15;
  // a ??= 23; //他覺得是廢話 所以黃

  // print(a); //15

  // int? b; //不能直接int b; 因為dart有空安全這東西 所以要加?

  // b ??= 23;

  // print(b); //23

  // 2. 複合賦值運算符號  +=   -=  *=  /=  %=  ~/=

  /* += */
  // int a = 12;

  // a += 10; // a = a + 10;

  // print(a); // 22


  /* -= */
  // int b = 12;

  // b -= 10; // b = b - 10;

  // print(b); // 2


  /* *= */

  // int c = 12;

  // c *= 10; // c = c * 10;

  // print(c); //120


  /* /= */

  // double d = 12; //除會有小數要用 double

  // d /= 10; // d = d / 10;

  // print(d); //1.2


  /* %= */

  // int e = 12;

  // e %= 10; // e = e % 10;

  // print(e); //2
  

  /* ~/= */

  // int f = 12;

  // f ~/= 10; // f = f ~/ 10;

  // print(f); //1
}
